---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.MoveNext
source: html/f26d5f7f-d594-c7dc-765a-b441ab62cb3c.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntriesIterator.MoveNext Method

Increments the iterator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is a next available item in this iterator.
 False if the iterator has completed all available items.